import codecs

with codecs.open("yojijukugo.txt", "r", "utf-8") as f:
	data = f.readlines()

dameKanji = "一二九七人入八力十三上下口大女山川工刀土千夕子小丁了又丸才中五六円天手文日月木水火犬王出右四左本正玉田白目石立万久今元公内分切午友太少引心戸方牛父毛止兄冬北半古台外市広母用矢世主他代写去号央平打氷申皮皿礼休先名字年早気百竹糸耳虫村男町花見貝赤足車不仕交会光同回多当毎池米羽考肉自色行西何体作図声売弟形来社角言谷走近里麦学林空金雨青草音化地両全向安州曲有次死羊血京国夜妹姉店明東歩画直知長前南室後思星活海点科茶食首欠氏由札民辺付以失必未末校夏家弱時紙記通高強教理組船週雪魚鳥黄黒支住助医君対局役投決究身者研馬森場朝番答絵買道間雲数楽話電所事使具受和始定実服泳物苦表部乗客屋度待持界発相県美負送重談要勝仮起速配酒院終習転進落葉軽運開集飲業漢路農鉄歌算聞語読鳴線横調親頭顔病最争仲伝共好成老位低初別利努労命岸放昔波注育拾指洋神秒級追戦競良功特便働令意味勉庭息旅根流消倍員島祭章第都動商悪族深球童陽階寒悲暑期植歯温港湯登着短野泉生亡合風予反々新返問宿想感整暗様橋福緑練詩銀題館駅億器士料標殺然熱課賞輪選鏡願養像情謝映疑皆例卒協参周囲固季完希念折望材束松残求的約芸基性技格能術私骨妥雰頑寺岩帰春昼晴秋計列区坂式信勇単司変夫建昨毒法泣浅紀英軍飯仏築晩猫園曜書遠門係取品守幸急真箱荷面典喜府治浴笑辞関保弁政留証険危存専冒冗阪原細薬鼻側兵堂塩席敗果栄梅無結因常識非干是渉虚官察底愛署警恋覚説幻訓試弓告種達類報祈等汽借焼座忘洗胸脳僧禅験可許枚静句禁喫煙加節減順容布易財若詞昆閥歴舌冊宇宙忙履団暴混乱徒得改続連善困絡比災機率飛害余難妨被裕震尻尾械確嫌個圧在夢産倒臭厚妻議犯罪防穴論経笛史敵済委挙判制務査総設資権件派岡素断評批任検審条責省増税解際認企義罰誕脱過坊寝宮各案置費価勢営示統領策藤副観値吸域姿応提援状態賀収停革職鬼規護割裁崎演律師看準則備導幹張優宅沢贅施現乳呼城俳秀担額製違輸燃祝届狭肩腕腰触載層型庁視差管象量境環武質述供展販株限与含影況渡響票景抜訴訟逮補候構模捕鮮効属慣豊満肥巻捜絞輩隠掛替居造授印創復往較筆鉛貯故障従我激刺励討郵針徴怪獣突菓河振汗豚再接独占招段胃腹痛退屈悩暇織貸迷惑誘就訪怒昇眠睡症締迫靴濃端極途健康郎給逆巨庫児冷凍幼稚処博清潔録隊修券婦奇妙麗微益移程精絶並憲衆傘浜撃攻監杯乾催促欧江請雄韓壊診閣僚積督臣略航寄板街宗緊娘宴怖恐添猛烈索詰詳魅渇系婚遊旗照快版貧乏適預延翌覧懐押更枕浮漏符購越飾騒背撮盗離融編華既普豪鑑除尋幾廊掃泥棒驚嘆倉孫巣帯径救散粉脈菜貨陸似均墓富徳探偵綺序迎志恩採桜永液眼祖績興衛複雑賛酸銭飼傷党卵厳捨込密汚欲暖机秘訳染簡閉誌窓否筋垂宝宣尊忠拡操敬暮灰熟異皇盛砂漠糖納肺著蒸蔵装裏諸賃誤臓貴降丼吐奴隷芋縮純縦粋聖磁紅射幕拝薦推揮沿源劇勤歓承損枝爪豆刻腐遅彫測破舎講滞紹介己厄亀互剣寿彼恥杉汁噌炎為熊獄酔酢鍋湖銅払油醤旧姓貿将盟遺伸債及奈幅廃甘換摘核沖縄津献療継維舞伎踏般頼依鹿諾牙跳昭漁償刑募執塁崩患戻抗抵旬湾爆弾聴跡遣闘陣香兆臨削契恵抱掲狙葬需齢宜繰避妊娠致刊奏伴併傾却奥慮懸房扱抑択描盤称緒緩託賄賂贈逃還超邦鈴阜岐隆雇控壁棋渋片群仙充免勧圏埋埼奪御慎拒枠甲斐祉稲譲謙躍銃項鋼顧駐駆柱唱孝俊兼剤吹堀巡戒排携敏鋭敷殿犠獲茂繁頻殖薄衝誉褒透隣雅遜伺徹瀬撤措拠儀樹棄虎蛍蜂酎蜜墟艦潜拳炭畑包衣仁鉱至誠郷侵偽克到双哲喪堅床括弧挑掘揚握揺斎暫析枢軸柄泊滑潟焦範紛糾綱網肝芝荒袋誰珍裂襲貢趣距籍露牧刷朗潮即垣威封筒岳慰懇懲摩擦撲斉旨柔沈沼泰滅滋炉琴寸竜縁翼吉刃忍桃辛謎侍俺叱娯斗朱丘梨僕匹叫釣髪嵐笠涙缶姫棚粒砲雷芽塔澄矛肌舟鐘凶塊狩頃魂脚也井呪嬢暦曇眺裸賭疲塾卓磨菌陰霊湿硬稼嫁溝滝狂翔墨鳩穏鈍魔寮盆棟吾斬寧椅歳涼猿瞳鍵零碁租幽泡癖鍛錬穂帝瞬菊誇庄阻黙俵綿架砕粘粧欺詐霧柳伊佐尺哀唇塀墜如婆崖帽幣恨憎憩扇扉挿掌滴炊爽畳瞭箸胴芯虹帳蚊蛇貼辱鉢闇隙霜飢餓畜迅騎蓄尽彩憶溶耐踊賢輝脅麻灯咲培悔脇遂班塗斜殴盾穫巾駒紫抽誓悟拓拘礎鶴刈剛唯壇尼概浸淡煮覆謀陶隔征陛俗桑潤珠衰奨劣勘妃丈峰巧邪駄唐廷鬱鰐蟹簿彰漫訂諮銘堰堤漂翻軌后奮亭仰伯偶淀墳壮把搬晶洞涯疫孔偉頂召挟枯沸濯燥瓶耕肯脂膚軒軟郊隅隻邸郡釈肪喚媛貞玄苗渦慈襟蓮亮聡浦塚陥貫覇呂茨擁孤賠鎖噴祥牲秩唆膨芳恒倫陳須偏遇糧殊慢没怠遭惰猟乃綾颯隼輔寛胞浄随稿丹壌舗騰緯艇披錦准剰繊諭惨虐据徐搭蒙鯉戴緋曙胡瓜帥啓葵駿諒莉鯨荘栽拐冠勲酬紋卸欄逸尚顕粛愚庶践呈疎疾謡鎌酷叙且痴呆哺傲茎阿悠杏茜栞伏鎮奉憂朴栃惜佳悼該赴髄傍累癒郭尿賓虜憾弥粗循凝脊昌旦愉抹栓之龍遼瑛那拍猶宰寂縫呉凡恭錯穀陵弊舶窮悦縛轄弦窒洪摂飽紳庸靖嘉搾蝶碑尉凛匠遥智柴賊鼓旋腸槽伐漬坪紺羅峡俸醸弔乙遍衡款閲喝敢膜盲胎酵堕遮烏凸凹楓哉蒼瑠萌硫赦窃慨扶戯忌濁奔肖朽殻享藩媒鶏嘱迭椎絹陪剖譜淑帆憤酌暁傑錠凌瑞菅漣璃遷拙峠篤叔雌堪吟甚崇漆岬紡礁屯姻擬睦閑曹詠卑侮鋳蔑胆浪禍酪憧慶亜汰梓沙逝匿寡痢坑藍畔唄拷渓廉謹湧醜升殉煩劾桟婿慕罷矯某囚泌漸藻妄蛮倹狐匂嬉嘘串喉叩飴噂諦捉膝眉濡痩羨慌挨拶斤袖凄妖喋鮭宛蹴喧嘩麺苺股柵噛狼咳拉苛煎戚餅屁璧痒冥莫頁勿"
orderedData = []
for d in data:
	tempd = d.split("\t")
	source = tempd[0]
	yojijukugo = tempd[1][:4]
	damedayo = False
	for kanji in yojijukugo:
		if kanji not in dameKanji:
			damedayo = True
	if damedayo: continue
	tempd = tempd[1].split("[", 1)[1].split("]", 1)
	pronounciation = tempd[0]
	tempd = tempd[1].split("(", 1)[1].split(")", 1)
	properties = tempd[0].split(",")
	tempd = tempd[1][1:]
	if "/" not in tempd:
		definitions = [tempd]
	else:
		definitions = tempd.split("/")
	definitions = list(map(lambda x: x.lower(), definitions))
	for i in range(len(definitions)): definitions[i] = definitions[i].replace(".", "").replace("!", "").replace("?", "")
	newDefinitions = []
	for i in range(len(definitions)):
		if ";" in definitions[i]:
			newDefinitions.extend(definitions[i].split(";"))
		else:
			newDefinitions.append(definitions[i])
	definitions = newDefinitions
	for i in range(len(definitions)):
		if definitions[i] == "":
			continue
		if definitions[i][0] == " ":
			definitions[i] = definitions[i][1:]
		if definitions[i][-1] == " ":
			definitions[i] = definitions[i][:-1]
	if definitions[0] == "" and len(definitions) == 1:
		continue
	elif definitions[-1] == "":
		definitions = definitions[:-1]
	elif definitions[-1] == "\r\n":
		definitions = definitions[:-1]
	orderedData.append([source, yojijukugo, pronounciation, properties, definitions])

print(orderedData)
print(len(orderedData))